results/snapshots/vuser_1/iteration_1/wr5.har

{
    "log": {
        "version": "1.2",
        "creator": {
            "name": "DevWeb",
            "version": "1.2"
        },
        "pages": [
            {
                "startedDateTime": "2020-07-15T12:43:30-07:00",
                "id": "page_1",
                "title": "http://www.advantageonlineshopping.com/accountservice/AccountLoginRequest",
                "pageTimings": {}
            }
        ],
        "entries": [
            {
                "pageref": "page_1",
                "startedDateTime": "2020-07-15T12:43:30-07:00",
                "time": 0,
                "_isResource": false,
                "request": {
                    "method": "POST",
                    "url": "http://www.advantageonlineshopping.com/accountservice/AccountLoginRequest",
                    "httpVersion": "HTTP/1.1",
                    "cookies": null,
                    "headers": [
                        {
                            "name": "Accept",
                            "value": "application/xml, text/xml, */*; q=0.01"
                        },
                        {
                            "name": "Accept-Encoding",
                            "value": "gzip, deflate"
                        },
                        {
                            "name": "Accept-Language",
                            "value": "en-US,en;q=0.9"
                        },
                        {
                            "name": "Content-Length",
                            "value": "506"
                        },
                        {
                            "name": "Content-Type",
                            "value": "text/xml; charset=UTF-8"
                        },
                        {
                            "name": "Host",
                            "value": "www.advantageonlineshopping.com"
                        },
                        {
                            "name": "Origin",
                            "value": "http://www.advantageonlineshopping.com"
                        },
                        {
                            "name": "Referer",
                            "value": "http://www.advantageonlineshopping.com/"
                        },
                        {
                            "name": "SOAPAction",
                            "value": "com.advantage.online.store.accountserviceAccountLoginRequest"
                        },
                        {
                            "name": "User-Agent",
                            "value": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36"
                        },
                        {
                            "name": "X-Requested-With",
                            "value": "XMLHttpRequest"
                        }
                    ],
                    "queryString": [],
                    "postData": {
                        "mimeType": "text/xml; charset=UTF-8",
                        "params": [
                            {
                                "name": "<?xml version",
                                "value": "\"1.0\" encoding=\"UTF-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\n               xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n    <soap:Body>\n        <AccountLoginRequest xmlns=\"com.advantage.online.store.accountservice\">\n            <email></email>\n            <loginPassword>Mercury</loginPassword>\n            <loginUser>Mercury</loginUser>\n        </AccountLoginRequest>\n    </soap:Body>\n</soap:Envelope>"
                            }
                        ],
                        "text": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"\n               xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n    <soap:Body>\n        <AccountLoginRequest xmlns=\"com.advantage.online.store.accountservice\">\n            <email></email>\n            <loginPassword>Mercury</loginPassword>\n            <loginUser>Mercury</loginUser>\n        </AccountLoginRequest>\n    </soap:Body>\n</soap:Envelope>"
                    },
                    "headersSize": -1,
                    "bodySize": 506
                },
                "response": {
                    "status": 200,
                    "statusText": "OK",
                    "httpVersion": "HTTP/1.1",
                    "cookies": null,
                    "headers": [
                        {
                            "name": "Accept",
                            "value": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2"
                        },
                        {
                            "name": "Access-Control-Allow-Headers",
                            "value": "Origin, X-Requested-With, Content-Type, Accept, Key, soapaction"
                        },
                        {
                            "name": "Access-Control-Allow-Methods",
                            "value": "POST, GET, OPTIONS, DELETE"
                        },
                        {
                            "name": "Access-Control-Allow-Origin",
                            "value": "*"
                        },
                        {
                            "name": "Access-Control-Max-Age",
                            "value": "3600"
                        },
                        {
                            "name": "Access-Control-Request-Method",
                            "value": "POST, GET, OPTIONS, DELETE"
                        },
                        {
                            "name": "Cache-Control",
                            "value": "no-store"
                        },
                        {
                            "name": "Connection",
                            "value": "keep-alive"
                        },
                        {
                            "name": "Content-Length",
                            "value": "791"
                        },
                        {
                            "name": "Content-Type",
                            "value": "text/xml;charset=utf-8"
                        },
                        {
                            "name": "Date",
                            "value": "Wed, 15 Jul 2020 19:43:25 GMT"
                        },
                        {
                            "name": "Expires",
                            "value": "0"
                        },
                        {
                            "name": "Server",
                            "value": "nginx/1.14.0 (Ubuntu)"
                        },
                        {
                            "name": "Soapaction",
                            "value": "\"\""
                        }
                    ],
                    "content": {
                        "size": 791,
                        "mimeType": "text/xml;charset=utf-8",
                        "text": "<SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:AccountLoginResponse xmlns:ns2=\"com.advantage.online.store.accountservice\"><ns2:StatusMessage><ns2:success>true</ns2:success><ns2:userId>617150899</ns2:userId><ns2:reason>Login Successful</ns2:reason><ns2:token>eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJ3d3cuYWR2YW50YWdlb25saW5lc2hvcHBpbmcuY29tIiwidXNlcklkIjo2MTcxNTA4OTksInN1YiI6Ik1lcmN1cnkiLCJyb2xlIjoiQURNSU4ifQ.mgJXJx96Vg5QXSp1C3KkMm3UALX1VxszguzZ9O9Rdm0</ns2:token><ns2:sessionId>1735400cc93@7E47F132B19^i%617150899</ns2:sessionId><ns2:t_authorization>TWVyY3VyeTpNZXJjdXJ5</ns2:t_authorization><ns2:accountType>10</ns2:accountType></ns2:StatusMessage></ns2:AccountLoginResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>"
                    },
                    "redirectURL": "",
                    "headersSize": 567,
                    "bodySize": 791
                },
                "cache": {},
                "timings": {
                    "send": 0,
                    "wait": 0,
                    "receive": 0
                }
            }
        ],
        "_webSocketEntries": {},
        "_settings": {
            "_proxy": {}
        }
    }
}
